Documents/ЗаказНаВнутреннееПотребление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗаказНаВнутреннееПотребление</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГИГ_ОЕМПотребность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГИГ_ПредставлениеОЕМПотребности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГИГ_Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтгружатьЧастями</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рин1_ДопоставкаПоРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рин1_ОЕМ_однократная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Требуется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьОбособленно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаВнутреннееПотребление/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГИГ_ГИГ_ОЕМПотребностьПриИзменении(Элемент) //ОЕМПотребность
	
	ГИГ_ОЕМПотребностьУстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ГИГ_ОЕМПотребностьУстановитьВидимостьНаСервере() //ОЕМПотребность
	
	Элементы.ГИГ_Партнер.Видимость = Объект.ГИГ_ОЕМПотребность;
	Элементы.ГИГ_ПредставлениеОЕМПотребности.Видимость = Объект.ГИГ_ОЕМПотребность;
//{{20201005 ГлазуновДВ
	Элементы.Однократно.Доступность = Объект.ГИГ_ОЕМПотребность;
	Элементы.ГИГ_Партнер.Доступность = Объект.ГИГ_ОЕМПотребность;
	Элементы.ГИГ_ПредставлениеОЕМПотребности.Доступность = Объект.ГИГ_ОЕМПотребность;
	Если Не Объект.ГИГ_ОЕМПотребность Тогда
		Объект.Рин1_ОЕМ_однократная = Ложь;
		Объект.ГИГ_Партнер = Справочники.Партнеры.ПустаяСсылка();
		Объект.ГИГ_ПредставлениеОЕМПотребности = "";
	КонецЕсли;
//}}20201005 ГлазуновДВ		
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) //ОЕМПотребность
	
	ГИГ_ОЕМПотребностьУстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ГИГ_ПрограммноеДобавлениеЭлементовНаСервере()
	
	Элемент_Группа = Элементы.Добавить("ГруппаОЕМПотребность", Тип("ГруппаФормы"), Элементы.Шапка);
	Элемент_Группа.Заголовок = "ОЕМ потребность";
	Элемент_Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элемент_Группа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	Элемент_Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
//{{20201005 ГлазуновДВ добавили "ГруппаФлажков"
	Элемент_Группа1 = Элементы.Добавить("ГруппаФлажков", Тип("ГруппаФормы"), Элемент_Группа);
	//Элемент_Группа1.Заголовок = "";
	Элемент_Группа1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элемент_Группа1.ОтображатьЗаголовок = Ложь;
	//Элемент_Группа1.Отображение = ОтображениеОбычнойГруппы.Нет;
	Элемент_Группа1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//}}20201005 ГлазуновДВ
	
	Элемент = Элементы.Добавить("ГИГ_ОЕМПотребность", Тип("ПолеФормы"), Элемент_Группа1); 
//	Элемент = Элементы.Добавить("ГИГ_ОЕМПотребность", Тип("ПолеФормы"), Элемент_Группа); 
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = "Объект.ГИГ_ОЕМПотребность"; 
	Элемент.Заголовок = "ОЕМ потребность";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.УстановитьДействие("ПриИзменении", "ГИГ_ГИГ_ОЕМПотребностьПриИзменении");

//{{20201005 ГлазуновДВ
	Элемент = Элементы.Добавить("Однократно", Тип("ПолеФормы"), Элемент_Группа1); 
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = "Объект.Рин1_ОЕМ_однократная";
	Элемент.Заголовок = "Однократно";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
//}}20201005 ГлазуновДВ
	
	Элемент = Элементы.Добавить("ГИГ_Партнер", Тип("ПолеФормы"), Элемент_Группа); 
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ГИГ_Партнер"; 
	Элемент.Заголовок = "Партнер";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	Элемент = Элементы.Добавить("ГИГ_ПредставлениеОЕМПотребности", Тип("ПолеФормы"), Элемент_Группа); 
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ГИГ_ПредставлениеОЕМПотребности"; 
	Элемент.Заголовок = "Представление ОЕМ потребности";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
КонецПроцедуры

&НаСервере
Процедура Рин1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГИГ_ПрограммноеДобавлениеЭлементовНаСервере();
	ГИГ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
&Вместо("Подключаемый_ОбработатьЗаписьОбъекта")
Процедура Рин1_Подключаемый_ОбработатьЗаписьОбъекта()
	
	Если Объект.ГИГ_ОЕМПотребность Тогда
		Для каждого Строка Из Объект.Товары Цикл
			Если не Строка.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Обособленно") Тогда
				Сообщить("Документ с ОЕМ потребностью. Все строки табличной части товары должны обеспечиваться обособленно!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

// + [Rineco], [Киселев А.Н.] [10.09.2021] 
// Задача: [№ 1853], [#Контроль удаленных позций в ТЧ]
&НаКлиенте
Процедура Рин1_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Ринэко_КонтрольУдаленныхПозицийКлиент.НачатьКонтрольУдаленныхПозиций(ЭтотОбъект,Отказ,ПараметрыЗаписи);
КонецПроцедуры
// - [Rineco], [Киселев А.Н.] [10.09.2021]
